{"meta":{"title":"Beauties Collection","subtitle":null,"description":null,"author":"Key","url":"http://yoursite.com","root":"/"},"pages":[{"title":"archives","date":"2019-10-11T00:10:55.000Z","updated":"2019-10-11T00:10:55.411Z","comments":true,"path":"archives/index.html","permalink":"http://yoursite.com/archives/index.html","excerpt":"","text":""},{"title":"","date":"2015-08-16T06:58:08.000Z","updated":"2018-01-26T06:41:06.000Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"HipaperA fashional newspaper, blog theme for Hexo. ☞ Preview Demo | 查看中文使用文档","text":"HipaperA fashional newspaper, blog theme for Hexo. ☞ Preview Demo | 查看中文使用文档 Installation Get it from GitHub 1$ git clone https://github.com/iTimeTraveler/hexo-theme-hipaper.git themes/hipaper Enable Modify theme setting in _config.yml to hipaper. 1234# Extensions## Plugins: http://hexo.io/plugins/## Themes: http://hexo.io/themes/theme: hipaper Update 12$ cd themes/hipaper$ git pull FeaturesLogo: Image or TextYou can set a image as your logo instead of original text title. Like this: just enable avatar field in hipaper/_config.yml. 12345678# Put your avatar.jpg into `hexo-site/themes/hipaper/source/` directory.# url is target link (E.g. `url: https://hexo.io/logo.svg` or `url: css/images/mylogo.jpg`)avatar: enable: true width: 124 height: 124 bottom: 10 url: https://hexo.io/logo.svg Code HighlightHipaper use Tomorrow Theme for your code block. We have six options in total: default, normal, night, night blue, night bright, night eighties Above preview picture is default theme. the image below show other five Highlight themes. Modify highlight_theme in hipaper/_config.yml. 12345# Code Highlight theme# Available value:# default | normal | night | night eighties | night blue | night bright# https://github.com/chriskempson/tomorrow-themehighlight_theme: default SidebarYou can put your sidebar in left side, right side or bottom of your site by editing sidebar setting.Hipaper provides 7 built-in widgets: search social recent_posts category tag tagcloud archive All of them are enabled by default. You can edit them in widget setting. SearchHipaper use Insight Search to help you search anything inside your site without any third-party plugin. 12345# Searchsearch: insight: true # you need to install `hexo-generator-json-content` before using Insight Search swiftype: # enter swiftype install key here baidu: false # you need to disable other search engines to use Baidu search, options: true, false Attention: You need to install hexo-generator-json-content before using Insight Search. 1$ npm install -S hexo-generator-json-content FancyboxHipaper uses Fancybox to showcase your photos. You can use Markdown syntax or fancybox tag plugin to add your photos. 123![img caption](img url)&#123;% fancybox img_url [img_thumbnail] [img_caption] %&#125; Comment supportHipaper has native support for DuoShuo &amp; Disqus comment systems. Modify the following snippets to Hipaper hipaper/_config.yml: 123# comment ShortName, you can choose only ONE to display.duoshuo_shortname: iTimeTravelerdisqus_shortname: Browser support ContributingAll kinds of contributions (enhancements, new features, documentation &amp; code improvements, issues &amp; bugs reporting) are welcome. Looking forward to your pull request. Special thanks to ATHEMES, who designed the original theme FASHIONISTA for Wordpress. LicenseHipaper is under the MIT license. See the LICENSE file for details."},{"title":"Categories","date":"2019-10-08T00:44:12.000Z","updated":"2019-10-08T00:45:06.808Z","comments":false,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"Tags","date":"2019-10-08T00:23:11.000Z","updated":"2019-10-08T00:43:51.974Z","comments":false,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Best Pro Eyeshadow Palette Makeup","slug":"Best Pro Eyeshadow Palette Makeup","date":"2019-10-10T14:55:38.000Z","updated":"2019-10-15T00:01:32.718Z","comments":false,"path":"lifeStyle/markup/Best Pro Eyeshadow Palette Makeup/","link":"","permalink":"http://yoursite.com/lifeStyle/markup/Best Pro Eyeshadow Palette Makeup/","excerpt":"Lamora Beauty combines luxury and affordability like no other beauty brand can. Our mission is to empower you to look, feel, and be your best, without sacrificing fiscal responsibility. At every stage from research to delivery, our luxury products are designed to maximize performance and minimize consumer expense. By maintaining this mindset throughout the entire production cycle, we can provide high-quality products that match our mission and helps you succeed.","text":"Lamora Beauty combines luxury and affordability like no other beauty brand can. Our mission is to empower you to look, feel, and be your best, without sacrificing fiscal responsibility. At every stage from research to delivery, our luxury products are designed to maximize performance and minimize consumer expense. By maintaining this mindset throughout the entire production cycle, we can provide high-quality products that match our mission and helps you succeed. Look, feel, and be your best with this gorgeous eyeshadow palette from Lamora Beauty. With 16 pigment-rich colors, serious staying power, and incredible blendability, this is a must-have product for your makeup bag. Created with ingredients of the highest quality and the most updated, ultra-micronized, luxuriously pigmented eyeshadow formula, this set combines luxury and affordability like no other eyeshadow palette can.","categories":[{"name":"lifeStyle","slug":"lifeStyle","permalink":"http://yoursite.com/categories/lifeStyle/"},{"name":"markup","slug":"lifeStyle/markup","permalink":"http://yoursite.com/categories/lifeStyle/markup/"}],"tags":[{"name":"sticky","slug":"sticky","permalink":"http://yoursite.com/tags/sticky/"},{"name":"template","slug":"template","permalink":"http://yoursite.com/tags/template/"}]},{"title":"BS-MALL Makeup Brushes Premium Synthetic Foundation Powder Concealers","slug":"BS-MALL-Brushes-Synthetic-Foundation-Concealers","date":"2019-10-10T13:55:38.000Z","updated":"2019-10-13T07:09:57.224Z","comments":false,"path":"lifeStyle/markup/BS-MALL-Brushes-Synthetic-Foundation-Concealers/","link":"","permalink":"http://yoursite.com/lifeStyle/markup/BS-MALL-Brushes-Synthetic-Foundation-Concealers/","excerpt":"Perfect for gift!Intended for makeup beginners and enthusiasts, the rose gold makeup brush kit is a selected gift for mom, wife, female friends at any occasion-Christmas, Thanksgiving Day, Mother’s Day, wedding anniversary and so on..","text":"Perfect for gift!Intended for makeup beginners and enthusiasts, the rose gold makeup brush kit is a selected gift for mom, wife, female friends at any occasion-Christmas, Thanksgiving Day, Mother’s Day, wedding anniversary and so on.. BS-MALL 14-PIECE MAKE-UP BRUSH SETDesigned for home &amp; professional use!The brush set comes in different shapes and sizes to cover you need to do makeup on different areas of the face and it fits for every face shape. The eye brushes made of premium synthetic fiber materials with wooden handle provide an incredible touch and feelings. This master set of eye brushes are ideal for liquids, powders, or creams to produce a beautiful eye and face makeup application. Covering all size and shape of brushes to create a variety of face makeup, the unique brush set can meet all your needs, show your natural beauty and leave a flawless makeup. The handles of makeup brushes are made of high-end alloy and wood material. Easy to grab and durable for long time using. The bristles of the makeup brush kit are well made of durable synthetic fiber - soft and silky nylon. No cruelty and skin-friendly.","categories":[{"name":"lifeStyle","slug":"lifeStyle","permalink":"http://yoursite.com/categories/lifeStyle/"},{"name":"markup","slug":"lifeStyle/markup","permalink":"http://yoursite.com/categories/lifeStyle/markup/"}],"tags":[{"name":"sticky","slug":"sticky","permalink":"http://yoursite.com/tags/sticky/"},{"name":"template","slug":"template","permalink":"http://yoursite.com/tags/template/"}]},{"title":"Skone Insanely Intense Tattooed Liquid Eyeliner","slug":"Skone Insanely Intense Tattooed Liquid Eyeliner","date":"2019-10-10T13:55:38.000Z","updated":"2019-10-16T14:29:20.150Z","comments":false,"path":"lifeStyle/markup/Skone Insanely Intense Tattooed Liquid Eyeliner/","link":"","permalink":"http://yoursite.com/lifeStyle/markup/Skone Insanely Intense Tattooed Liquid Eyeliner/","excerpt":"Perfect Wings with Skone’s “Insanely Intense” Tattooed Liquid Eyeliner - Waterproof &amp; Smudge ProofSkone changed the cosmetic industry with this now iconic “Insanely Intense Tattooed Eyeliner.” Skone cemented itself as a noteworthy brand to the social networks growing number of discerning makeup lovers and cosmetic professionals the world over. Now available to the public.","text":"Perfect Wings with Skone’s “Insanely Intense” Tattooed Liquid Eyeliner - Waterproof &amp; Smudge ProofSkone changed the cosmetic industry with this now iconic “Insanely Intense Tattooed Eyeliner.” Skone cemented itself as a noteworthy brand to the social networks growing number of discerning makeup lovers and cosmetic professionals the world over. Now available to the public. It’s Not Just About the Perfect Wings and Creative Designs Skone’s focus is on your whole experience, from the easy to apply tip, to the insanely intense highly pigmented tones of our eyeliner. We believe that your beauty should be magnified and show the amazing spirit that lies within us all. About Out Insanely Intense Eyeliner Formula Skone followers love our tattooed eyeliner and now our professional formula is available to the public. The same high standards professional cosmetologies love and have come to expect from Skone - direct to you. Experience the Insane Skone Difference! Skone has become the “go to” eyeliner product for professional cosmetologists around the world. Our Tattooed Eyeliners and Brow Wands are used by leading makeup artists. Now, you can experience the same - Truly Fast Drying - luxurious, all day, long lasting waterproof, smudge-proof professional grade mascara serum. 4 Times More Product than Others When you buy Skone’s Tattooed Eyeliner, you enjoy 4X More product than other brands. Additionally, our highly pigmented formula allows you to apply less and get better, more intense results. Find out more about our Insanely Intense Eyeliner below…","categories":[{"name":"lifeStyle","slug":"lifeStyle","permalink":"http://yoursite.com/categories/lifeStyle/"},{"name":"markup","slug":"lifeStyle/markup","permalink":"http://yoursite.com/categories/lifeStyle/markup/"}],"tags":[{"name":"sticky","slug":"sticky","permalink":"http://yoursite.com/tags/sticky/"},{"name":"template","slug":"template","permalink":"http://yoursite.com/tags/template/"}]},{"title":"Eyeshadow Shield Eyeshadow Gel Pad","slug":"Eyeshadow Shield","date":"2019-10-10T13:55:38.000Z","updated":"2019-10-15T00:21:35.438Z","comments":false,"path":"lifeStyle/markup/Eyeshadow Shield/","link":"","permalink":"http://yoursite.com/lifeStyle/markup/Eyeshadow Shield/","excerpt":"Wide range of usesThe disposable eyeshadow shields are nice for lip makeup and eyeliner isolation. Simply press them under eye area can prevent your eyes from makeup residue under eye area.","text":"Wide range of usesThe disposable eyeshadow shields are nice for lip makeup and eyeliner isolation. Simply press them under eye area can prevent your eyes from makeup residue under eye area.","categories":[{"name":"lifeStyle","slug":"lifeStyle","permalink":"http://yoursite.com/categories/lifeStyle/"},{"name":"markup","slug":"lifeStyle/markup","permalink":"http://yoursite.com/categories/lifeStyle/markup/"}],"tags":[{"name":"sticky","slug":"sticky","permalink":"http://yoursite.com/tags/sticky/"},{"name":"template","slug":"template","permalink":"http://yoursite.com/tags/template/"}]},{"title":"The Youngfocus Cream Contour Kit for Your Skin Tone and Texture to Help Create the Perfect Contour!","slug":"The Youngfocus Cream Contour Kit for Your Skin Tone and Texture to Help Create the Perfect Contour!","date":"2019-10-10T13:55:38.000Z","updated":"2019-10-15T00:49:19.105Z","comments":false,"path":"lifeStyle/markup/The Youngfocus Cream Contour Kit for Your Skin Tone and Texture to Help Create the Perfect Contour!/","link":"","permalink":"http://yoursite.com/lifeStyle/markup/The Youngfocus Cream Contour Kit for Your Skin Tone and Texture to Help Create the Perfect Contour!/","excerpt":"The Youngfocus Cream Contour Palette Makeup Kit is divided into two parts: the modification of skin color and the shaping of contour.The cream contour is on your original face shape, so that your facial proportions are adjusted to tighten the stereo and achieve the perfect look.The Youngfocus Cream Contour Palette Makeup Kit ,contains 8 colors that are blended to cover the styling colors you need.Our makeup kit has a detailed guide to help beginners quickly grasp the styling tips.Make your own professional makeup artist.The Youngfocus Cream Contour Kit is dermatologist tested, hypoallergenic and is specially formulated using the highest quality, non-irritating ingredients!The Youngfocus Cream Contour Kit light and thin,breathable,easy to mix,hide the pores, skin smooth，lasting makeup!","text":"The Youngfocus Cream Contour Palette Makeup Kit is divided into two parts: the modification of skin color and the shaping of contour.The cream contour is on your original face shape, so that your facial proportions are adjusted to tighten the stereo and achieve the perfect look.The Youngfocus Cream Contour Palette Makeup Kit ,contains 8 colors that are blended to cover the styling colors you need.Our makeup kit has a detailed guide to help beginners quickly grasp the styling tips.Make your own professional makeup artist.The Youngfocus Cream Contour Kit is dermatologist tested, hypoallergenic and is specially formulated using the highest quality, non-irritating ingredients!The Youngfocus Cream Contour Kit light and thin,breathable,easy to mix,hide the pores, skin smooth，lasting makeup! Packaged In a Sleek, Travel-Friendly PaletteIt,Can Perfect Your Face Tour. Perfect Design,Easy to Carry!Youngfocus Cream Contour Kit Features: The Youngfocus Cream Contour Palette Makeup Kit contains 8 types of mixable cream contours. Suitable for all skin types and ages. Highlight and contouring the cheekbones helps slim the face and make cheeks appear lifted. Contouring along the hairline provides the appearance of a smaller forehead. Contouring the nose gives the appearance of a straighter and more defined shape. Highlighting the center of the forehead and chin creates the illusion of symmetry. The Youngfocus Cream Contour Kit light and thin,breathable,easy to mix,hide the pores, skin smooth，lasting makeup. Cosmetic brushes and sponges can be used interchangeably for cream contouring. Includes step by step instructions andAll facial shapes. Easy to Grasp Creamy Contour Kit!","categories":[{"name":"lifeStyle","slug":"lifeStyle","permalink":"http://yoursite.com/categories/lifeStyle/"},{"name":"markup","slug":"lifeStyle/markup","permalink":"http://yoursite.com/categories/lifeStyle/markup/"}],"tags":[{"name":"sticky","slug":"sticky","permalink":"http://yoursite.com/tags/sticky/"},{"name":"template","slug":"template","permalink":"http://yoursite.com/tags/template/"}]},{"title":"UCANBE Fiesta Makeup Set Duo 18 Colors High Pigmented Eyeshadow Palette","slug":"UCANBE Fiesta Makeup Set Duo 18 Colors High Pigmented Eyeshadow Palette","date":"2019-10-10T13:55:38.000Z","updated":"2019-10-16T01:01:04.734Z","comments":false,"path":"lifeStyle/markup/UCANBE Fiesta Makeup Set Duo 18 Colors High Pigmented Eyeshadow Palette/","link":"","permalink":"http://yoursite.com/lifeStyle/markup/UCANBE Fiesta Makeup Set Duo 18 Colors High Pigmented Eyeshadow Palette/","excerpt":"It’s a beautiful day to be alive with this fiesta set of ucanbe popular items. Equipped with 2 high pigmentaion eye shadow palettes, creamy lipstick &amp; mascara. Of course this kit has black waterproof eyeliner and soft makeup sponge too. This is the perfect professional makeup set!","text":"It’s a beautiful day to be alive with this fiesta set of ucanbe popular items. Equipped with 2 high pigmentaion eye shadow palettes, creamy lipstick &amp; mascara. Of course this kit has black waterproof eyeliner and soft makeup sponge too. This is the perfect professional makeup set! We choose to celebrate festival and this is a limited-edition version to help you save the money. And also let you experience ucanbe magic. It’s a good choice to send as gift to your friends or personal use","categories":[{"name":"lifeStyle","slug":"lifeStyle","permalink":"http://yoursite.com/categories/lifeStyle/"},{"name":"markup","slug":"lifeStyle/markup","permalink":"http://yoursite.com/categories/lifeStyle/markup/"}],"tags":[{"name":"sticky","slug":"sticky","permalink":"http://yoursite.com/tags/sticky/"},{"name":"template","slug":"template","permalink":"http://yoursite.com/tags/template/"}]}]}